Repository: bvst/artifex
Catalog: lib/l10n/app_*.arb
Languages: no

# appTagline
source: Your World, Reimagined
no: Din verden, nyforestilt

# welcomeTitle
source: Transform Your Photos with AI
no: Forvandle bildene dine med KI

# welcomeDescription
source: Turn your everyday photos into extraordinary works of art using the power of AI. Choose from various styles and let creativity flow.
no: Gjør hverdagsbildene dine til ekstraordinære kunstverk ved hjelp av KI. Velg mellom ulike stiler og la kreativiteten flyte.

# cameraButtonTitle
source: Take Photo
no: Ta bilde

# cameraButtonDescription
source: Capture a new photo with your camera
no: Ta et nytt bilde med kameraet

# galleryButtonTitle
source: Choose from Gallery
no: Velg fra galleri

# galleryButtonDescription
source: Select an existing photo from your gallery
no: Velg et eksisterende bilde fra galleriet

# choosePhotoPrompt
source: How would you like to add a photo?
no: Hvordan vil du legge til et bilde?

# photoCaptureFailed
source: Failed to capture photo
no: Kunne ikke ta bilde

# photoCaptureSuccess
source: Photo captured successfully!
no: Bilde tatt!

# photoCaptureError
source: Error capturing photo: {error}
no: Feil ved bildeopptaking: {error}

# cameraPermissionRequired
source: Camera permission is required. Please allow access in settings.
no: Kameraløyve kreves. Tillat tilgang i innstillinger.

# unexpectedErrorOccurred
source: An unexpected error occurred. Please try again.
no: En uventet feil oppstod. Prøv igjen.

# cameraFallbackMessage
source: Camera opens gallery on desktop
no: Kamera åpner galleri på datamaskin

source: Processing...
no: Behandler...

source: Retry
no: Prøv igjen

source: Settings
no: Innstillinger

source: Language
no: Språk

source: System Default
no: Systemstandard

source: English
no: Engelsk

source: Norwegian
no: Norsk

# languageChanged
source: Language changed to {language}
no: Språk endret til {language}

source: Select Filter
no: Velg Filter

source: Choose Your Vision
no: Velg Din Visjon

source: Transforming your photo...
no: Transformerer bildet ditt...

source: Please wait
no: Vennligst vent

source: Transformation complete!
no: Transformering fullført!

source: Transformation failed
no: Transformering mislyktes

source: Try Again
no: Prøv Igjen
